//------------------------------------------------------------------------------
// Rectangle.cpp - содержит реализацию методов класса Rectangle
//------------------------------------------------------------------------------

#include "Aphorism.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void Aphorism::InData(ifstream& ifst) {
	ifst >> author >> text;
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника
void Aphorism::Out(ofstream& ofst) {
	ofst << "Aphorism. Author: " << author << "; " << text << endl;
}

//------------------------------------------------------------------------------
// Создание фабрики прямоугольников
namespace {
	AphorismFactory rf;
}
