#ifndef __Aphorism__
#define __Aphorism__

//------------------------------------------------------------------------------
// Rectangle.h - содержит описание класса прямоугольника,
// порожденного от базового класса Figure
//------------------------------------------------------------------------------

#include "Wisdom.h"

//------------------------------------------------------------------------------
// прямоугольник
class Aphorism : public Wisdom
{
public:
	string author, text; // ширина, высота
	// переопределяем интерфейс класса
	void InData(ifstream& ifst);  // ввод данных из потока
	void Out(ofstream& ofst);     // вывод данных в стандартный поток

	// создание без инициализации.
	Aphorism() {}
};

//------------------------------------------------------------------------------
// Фабрика, обеспечивающая создание прямоугольников при чтении признака фигуры
class AphorismFactory : public WisdomFactory {
public:
	// Конструктор фабрики, устанавливющий признак прямоугольника (равен 1)
	AphorismFactory() :WisdomFactory(1) { }

	// Переопределение метода Create на создание прямоугольников.
	Wisdom* Create(int key) {
		if (key == mark)
			return new Aphorism;
		else
			return nullptr;
	}
};

#endif

