//------------------------------------------------------------------------------
// Container.cpp - содержит реализацию методов класса Container
//------------------------------------------------------------------------------

#include "HashTab.h"

//------------------------------------------------------------------------------
// Инициализация контейнера
HashTab::HashTab() : len(0) { }

//------------------------------------------------------------------------------
// Очистка контейнера от элементов (освобождение памяти)
void HashTab::Clear()
{
	for (int i = 0; i < len; i++)
	{
		delete cont[i];
	}
	len = 0;
}

//------------------------------------------------------------------------------
// Ввод содержимого контейнера
void HashTab::In(ifstream& ifst) {
	while (!ifst.eof())
	{
		if ((cont[len] = WisdomFactory::In(ifst)) != 0)
		{
			len++;
		}
	}
}

//------------------------------------------------------------------------------
// Вывод содержимого контейнера
void HashTab::Out(ofstream& ofst) {
	ofst << "Container contents " << len << " elements." << endl;
	for (int i = 0; i < len; i++) {
		ofst << i << ": ";
		cont[i]->Out(ofst);
	}
}
