//------------------------------------------------------------------------------
// Rectangle.cpp - содержит реализацию методов класса Rectangle
//------------------------------------------------------------------------------

#include "Proverb.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void Proverb::InData(ifstream& ifst) {
	ifst >> country >> text;
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника
void Proverb::Out(ofstream& ofst) {
	ofst << "Proverb. Country: " << country << "; " << text << endl;
}

//------------------------------------------------------------------------------
// Создание фабрики прямоугольников
namespace {
	ProverbFactory rf;
}

