//------------------------------------------------------------------------------
// Rectangle.cpp - содержит реализацию методов класса Rectangle
//------------------------------------------------------------------------------

#include "Riddle.h"

//------------------------------------------------------------------------------
// Ввод параметров прямоугольника
void Riddle::InData(ifstream& ifst) {
	ifst >> riddle >> answer;
}

//------------------------------------------------------------------------------
// Вывод параметров прямоугольника
void Riddle::Out(ofstream& ofst) {
	ofst << "Proverb. Riddle: " << riddle << " Answer: " << answer << endl;
}

//------------------------------------------------------------------------------
// Создание фабрики прямоугольников
namespace {
	RiddleFactory rf;
}

