// Figure.cpp - Реализация функций, поддерживающих работу с базовой фигурой.
// В основном это функции и данные фабрики абстрактной фигуры.

#include "Wisdom.h"

// Первоначальный список зарегистрированных фабрик пуст.
// Поэтому указатель обнулен.
WisdomFactory* WisdomFactory::top = nullptr;

// Конструктор, обеспечивающий начальную расстановку элементов в стеке и их ранжирование
WisdomFactory::WisdomFactory(int m) : mark(m)
{
	this->next = top;
	top = this;
}



//------------------------------------------------------------------------------
// Реализация метода, обеспечивающего создание фигуры по ее признаку,
// который задается при вводе из файла или из консоли (при реализации).
Wisdom* WisdomFactory::Make(int key)
{
	// Указатель, фиксирующий созданную фигуру
	Wisdom* w = nullptr;
	// Формирование указателя для обхода
	WisdomFactory* tmp = top;

	// Обход фабрик в стеке до той, у которой ключ совпадает с искомым
	while (tmp) {
		w = tmp->Create(key);
		// При создании фигуры обход завершается
		if (w) return w;
		tmp = tmp->next;
	}
	return nullptr;
}

// иденитфикация, порождение и ввод фигуры из потока
Wisdom* WisdomFactory::In(ifstream& ifst)
{
	Wisdom* pf = nullptr;
	int k;
	ifst >> k;
	pf = Make(k);
	if (pf)
		pf->InData(ifst);
	return pf;

}
